Shaping titanic data for a bar plot

In [1]:
import numpy as np
import pandas as pd
import datetime as datetime
import sys
import matplotlib.pyplot as plt
import matplotlib

%matplotlib inline

In [2]:
# check library versions
print ('pandas version is {}'.format(pd.__version__))
print ('numpy version is {}'.format(np.__version__))
print ('python version is {}'.format(sys.version))
print ('matplotlib version is {}'.format(matplotlib.__version__))

pandas version is 0.21.0
numpy version is 1.13.1
python version is 2.7.13 |Continuum Analytics, Inc.| (default, May 11 2017, 13:17:26) [MSC v.1500 64 bit (AMD64)]
matplotlib version is 2.1.0

In [3]:
df = pd.read_csv("titanic-data-original.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df = df[['Age', 'Sex', 'Pclass', 'Survived']]

In [5]:
print df.describe()
print df.info()

              Age      Pclass    Survived
count  714.000000  891.000000  891.000000
mean    29.699118    2.308642    0.383838
std     14.526497    0.836071    0.486592
min      0.420000    1.000000    0.000000
25%     20.125000    2.000000    0.000000
50%     28.000000    3.000000    0.000000
75%     38.000000    3.000000    1.000000
max     80.000000    3.000000    1.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
Age         714 non-null float64
Sex         891 non-null object
Pclass      891 non-null int64
Survived    891 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 27.9+ KB
None

In [6]:
df.dropna(inplace=True)

In [7]:
print df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 4 columns):
Age         714 non-null float64
Sex         714 non-null object
Pclass      714 non-null int64
Survived    714 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 27.9+ KB
None

In [8]:
df.head()

    Age     Sex  Pclass  Survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [9]:
#Add age group column
def ageGroup(age):
    if age <= 25:
        return "0-20"
    elif age <= 40:
        return "25-40"
    elif age <= 65:
        return "40-65"
    else:
        return "65+"

In [10]:
df['AgeGroup'] = df['Age'].apply(ageGroup)

In [11]:
df.head()

    Age     Sex  Pclass  Survived AgeGroup
0  22.0    male       3         0     0-20
1  38.0  female       1         1    25-40
2  26.0  female       3         1    25-40
3  35.0  female       1         1    25-40
4  35.0    male       3         0    25-40

In [12]:
df['Survived'] = df.Survived.map({1:'Survived', 0:'Perished'})
df['PassengerClass'] = df.Pclass.map({1:'First', 2:'Second', 3:'Third'})

In [20]:
df = df[['Sex', 'Survived', 'AgeGroup', 'PassengerClass']]
df['Count'] = 1
df.head()

      Sex  Survived AgeGroup PassengerClass  Count
0    male  Perished     0-20          Third      1
1  female  Survived    25-40          First      1
2  female  Survived    25-40          Third      1
3  female  Survived    25-40          First      1
4    male  Perished    25-40          Third      1

In [21]:
df.to_csv("titanicData.csv", sep=',')